ATsupportum/src/InformationRegisters/ПодписиПользователейДляУчетнойЗаписи_ат/ПодписиПользователейДляУчетнойЗаписи_ат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПодписиПользователейДляУчетнойЗаписи_ат</name>
  <resources>
    <name>Подпись</name>
    <type>
      <types>CatalogRef.ПодписиЭлектронныхПисем_ат</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ATsupportum/src/CommonModules/ПодписиЭлектронныхПисем_ат/Module.bsl
Функция ПолучитьПодписьПользователяПоУчетнойЗаписи(Пользователь, УчетнаяЗапись) Экспорт
	
	Запись = РегистрыСведений.ПодписиПользователейДляУчетнойЗаписи_ат.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда 
		Возврат Запись.Подпись;
	Иначе
		Запись.Пользователь = Неопределено;
		Запись.УчетнаяЗапись = УчетнаяЗапись;
		Запись.Прочитать();
		Если Запись.Выбран() Тогда 
			Возврат Запись.Подпись;
		Иначе
			Запись.Пользователь = Неопределено;
			Запись.УчетнаяЗапись = Неопределено;
			Запись.Прочитать();
			Если Запись.Выбран() Тогда 
				Возврат Запись.Подпись;
			Иначе
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьПодписьПользоваетляПоУчетнойЗаписи(Пользователь, УчетнаяЗапись, Подпись) Экспорт
	
	Запись = РегистрыСведений.ПодписиПользователейДляУчетнойЗаписи_ат.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.УчетнаяЗапись = УчетнаяЗапись;
	Запись.Пользователь = Подпись;
	Попытка
		Запись.Записать();
	Исключение
		Сообщить("Не удалось записать подпись пользователя " + Пользователь + " для учетной записи " + УчетнаяЗапись + "",
			СтатусСообщения.Важное);
	КонецПопытки;
	
КонецПроцедуры
